shercliff/baseCase/basecase_epotFoamCurrent_strongScaling_640k/0/jfinal
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      jfinal;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 0 0 -1 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    lowerWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    upperWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    frontWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    backWall
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //

